changes in documention to reflect the changes in system
